---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtrusionAnalyzer
source: html/428c1314-8e90-fd2e-973e-701288c71618.htm
---
# ExtrusionAnalyzer Methods

Calculates the alignment status of each face of the solid.